# Taps
#tap 'homebrew/cask-fonts'
#tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Generic 
# brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'svn' # Needed to install fonts
brew 'subversion'
brew 'stow'
brew 'htop'
brew 'wget'
brew 'zsh-completion'

# Development
brew 'cmake'
brew 'make'
brew 'gcc'
brew 'openmpi'
brew 'modules'
brew 'r'

# netcdf tools:
brew 'cdo'
brew 'eccodes'
brew 'hdf5' 
brew 'netcdf'
brew 'netcdf-fortran'
brew 'nco'
brew 'ncview'

# Apps
cask 'iterm2'
cask 'obsidian'
cask 'visit'
cask 'mactex'
cask 'paraview'
cask 'panoply'
cask 'rstudio'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlstephen'
cask 'qlcolorcode'
cask 'ipynb-quicklook'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

