# Taps
tap 'homebrew/bundle'

# Generic 
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'svn' # Needed to install fonts
brew 'subversion'
brew 'stow'
brew 'htop'
brew 'wget'
brew 'zsh-completions'
brew 'htop'
brew 'pandoc'

# Development
brew 'cmake'
brew 'make'
brew 'gcc'
brew 'openmpi'
brew 'modules'
brew 'r'
brew 'act'
brew 'dive'

# netcdf tools:
brew 'cdo'
brew 'eccodes'
brew 'hdf5' 
brew 'netcdf'
brew 'netcdf-fortran'
brew 'nco'
brew 'ncview'
brew 'perl'
brew 'gdal'